<?php
namespace App;

class Categories
{
    private static $_data = [
        [
            'category' => 'Зарплата Кирилл',
            'words' => ['Аванс', 'Зарплата Кирилл'],
            'order' => 1
        ],
        [
            'category' => 'Зарплата Галя',
            'words' => ['Зарплата', 'Заработок', 'Заработок Галя'],
            'order' => 2
        ],
        [
            'category' => 'Другое',
            'words' => ['Кешбек', 'Кэшбек'],
            'order' => 3
        ],
        [
            'category' => 'Инвестиции/вклады',
            'words' => ['Проценты', 'Вклад'],
            'order' => 4
        ],
        [
            'category' => 'Работа Кирилл',
            'words' => ['Работа'],
            'order' => 5
        ],
        [
            'category' => 'Работа Галя',
            'words' => ['Работа Галя'],
            'order' => 6
        ],
        [
            'category' => 'Продукты дом',
            'words' => ['Продукты'],
            'order' => 7
        ],
        [
            'category' => 'Лекарства/больница',
            'words' => ['Лекарства', 'Аптека', 'Анализ', 'Анализы', 'Зубы', 'Стоматолог', 'Больница'],
            'order' => 8
        ],
        [
            'category' => 'Проезд',
            'words' => ['Проезд', 'Проезд Галя', 'Проезд Артем', 'Проезд Кирилл'],
            'order' => 9
        ],
        [
            'category' => 'Хозтовары/инструмент/ремонт',
            'words' => ['Хозтовары', 'Инструмент', 'Ремонт'],
            'order' => 10
        ],
        [
            'category' => 'Одежа и обувь',
            'words' => ['Одежа', 'Обувь', 'Ботинки', 'Туфли', 'Джинсы', 'Куртка', 'Кофта', 'Штаны', 'Брюки'],
            'order' => 11
        ],
        [
            'category' => 'Развлечения',
            'words' => ['Кафе', 'Ресторан', 'Парк', 'Пицца'],
            'order' => 12
        ],
        [
            'category' => 'Канцтовары/книги',
            'words' => ['Канцтовары', 'Книги', 'Тетрадь', 'Тетради', 'Ручка', 'Ручки', 'Карандаш', 'Карандаши'],
            'order' => 13
        ],
        [
            'category' => 'Курсы/секции/подписки',
            'words' => ['Курсы', 'Секции', 'Подписки', 'Ютуб', 'Youtube', 'Хекслет', 'Hexlet', 'Бигбен'],
            'order' => 14
        ],
        [
            'category' => 'Спорттовары/игрушки',
            'words' => ['Спорттовары', 'Игрушки'],
            'order' => 15
        ],
        [
            'category' => 'Техника/мебель',
            'words' => ['Техника', 'Мебель'],
            'order' => 16
        ],
        [
            'category' => 'Дача',
            'words' => ['Дача'],
            'order' => 17
        ],
        [
            'category' => 'Отдых/отпуск',
            'words' => ['Отдых', 'Отпуск'],
            'order' => 18
        ],
        [
            'category' => 'Родителям',
            'words' => ['Родителям', 'Родители'],
            'order' => 19
        ],
        [
            'category' => 'Школа',
            'words' => ['Школа', 'Обложки'],
            'order' => 20
        ],
        [
            'category' => 'Вода питьевая/фильтры',
            'words' => ['Вода', 'Фильтр', 'Фильтры'],
            'order' => 21
        ],
        [
            'category' => 'Стрижка / ногти',
            'words' => ['Стрижка', 'Ногти'],
            'order' => 22
        ],
        [
            'category' => 'Моб.телефон',
            'words' => ['Моб.телефон', 'Мобильный', 'Телефон'],
            'order' => 23
        ],
        [
            'category' => 'Дни рождения',
            'words' => ['Дни рождения', 'ДР', 'День рождения'],
            'order' => 24
        ],
        [
            'category' => 'Праздники/подарки',
            'words' => ['Праздники', 'Подарки', 'Подарок'],
            'order' => 25
        ],
        [
            'category' => 'Квартплата/дом.интернет',
            'words' => ['Квартплата', 'Дом.интернет', 'Интернет', 'Квартира'],
            'order' => 26
        ],
        [
            'category' => 'Линзы/очки',
            'words' => ['Линзы', 'Очки', 'Жидкость для линз'],
            'order' => 27
        ],
        [
            'category' => 'Бензин',
            'words' => ['Бензин', 'Заправка'],
            'order' => 28
        ],
        [
            'category' => 'Авто (разное)',
            'words' => ['Авто', 'Техосмотр', 'ТО'],
            'order' => 29
        ],
        [
            'category' => 'Кошка',
            'words' => ['Кошка', 'Корм', 'Корм для кошки'],
            'order' => 30
        ],
        [
            'category' => 'Прочее',
            'words' => ['Прочее'],
            'order' => 31
        ]
    ];


    public static function findKeysByValue(string $value)
    {
        $result = collect(self::$_data)
            ->filter(fn ($item) => collect($item['words'])->contains($value))
            ->map(fn ($item) => $item['category']);

        return $result->all();

    }
}
